{
  "backend/main.mo": "Motoko canister implementing role‑based repair ticket management with CRUD operations, status updates, and access‑controlled queries.",
  "feature_evidence.json": "Feature evidence file describing image‑related UI updates, affected components, and associated test coverage.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files detailing routing, components, hooks, pages, and styling.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens for the app.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React layout with header, navigation, routing, and role‑based UI behavior using TanStack Router.",
  "frontend/src/components/AuthButton.tsx": "Authentication button component handling Internet Identity login/logout and query cache resets.",
  "frontend/src/components/AuthGate.tsx": "Wrapper that blocks access for unauthenticated users and displays a sign‑in prompt.",
  "frontend/src/components/StatusHistoryTimeline.tsx": "Timeline renderer showing ticket status history with formatted dates and notes.",
  "frontend/src/components/TicketStatusBadge.tsx": "Badge component mapping ticket status values to labels and visual variants.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the authenticated or anonymous backend actor with automatic query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and loading stored identities.",
  "frontend/src/hooks/useRole.ts": "Exposes hooks to fetch the caller's user role and determine admin status via the backend actor.",
  "frontend/src/hooks/useTickets.ts": "Defines React Query hooks for creating, fetching, and updating repair tickets through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and a light/dark theme using CSS variables for a charcoal/amber design.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CreateTicketPage.tsx": "Implements a form for creating repair tickets and displays a confirmation view after submission.",
  "frontend/src/pages/MyTicketsPage.tsx": "Displays the logged‑in user's repair tickets with sorting, status badges, and navigation options.",
  "frontend/src/pages/StaffDashboardPage.tsx": "Staff‑only dashboard for viewing, filtering, and updating all repair tickets with admin checks.",
  "frontend/src/pages/TicketDetailsPage.tsx": "Renders a ticket details view with loading and error states, showing customer/device info and status history using various UI components.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read URL parameters, persist them in sessionStorage, and manipulate hash query params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, fonts, animations, plugins, and content scanning paths.",
  "project_state.json": "Tracks project metadata, features, issues, and image requirements for the HEIFIX app."
}