{
  "backend/main.mo": "Motoko canister implementing role‑based access control and full repair ticket CRUD with status updates, history tracking, and user/admin query methods.",
  "feature_evidence.json": "Metadata file describing features, related frontend files, components, and test IDs for authentication behavior improvements.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files, used as reference for build or documentation automation.",
  "frontend/index.css": "Tailwind base styles defining custom charcoal/amber OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Static HTML entry point loading the React application via main.tsx with HEIFIX branding.",
  "frontend/src/App.tsx": "Main React layout and routing setup including header navigation, mobile menu, role-aware links, and page mounting.",
  "frontend/src/components/AuthButton.tsx": "Login/logout UI component using Internet Identity, showing errors with retry action and clearing cache on logout.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard that blocks unauthenticated users and displays login errors plus troubleshooting tips.",
  "frontend/src/components/StatusHistoryTimeline.tsx": "Visual timeline rendering ticket status history with timestamps, badges, and optional notes.",
  "frontend/src/components/TicketStatusBadge.tsx": "Badge component mapping ticket status values to readable labels and UI variants.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity restoration.",
  "frontend/src/hooks/useRole.ts": "Defines hooks to fetch the caller's role and admin status from the backend using the actor.",
  "frontend/src/hooks/useTickets.ts": "Implements ticket-related hooks for creating tickets, fetching user/all tickets, getting ticket details, and updating ticket status.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom light/dark theme using CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CreateTicketPage.tsx": "UI page for submitting a repair ticket, validating input, and showing the created ticket confirmation.",
  "frontend/src/pages/MyTicketsPage.tsx": "Displays the user's tickets with sorting, loading states, and navigation options.",
  "frontend/src/pages/StaffDashboardPage.tsx": "Admin-only dashboard displaying and filtering all tickets, with UI to edit ticket status, notes, and price estimates.",
  "frontend/src/pages/TicketDetailsPage.tsx": "Shows full ticket details, status history, and metadata with loading/error handling and navigation back to the user's tickets list.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, breakpoints, animations, and plugins for consistent UI styling.",
  "project_state.json": "Tracks project metadata, features, issues, and requirements for the HEIFIX app’s current development state."
}