{
  "kind": "build_request",
  "title": "Fix Internet Identity login flow UX and error handling",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Fix the Sign In / Sign Out button behavior so it no longer incorrectly `await`s non-Promise `login()` / `clear()` calls, and so the UI remains responsive and consistent during login/logout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "nao esta dandopara fezer loguin"
        ]
      },
      "acceptanceCriteria": [
        "Clicking “Sign In” triggers Internet Identity login reliably without unhandled promise/async errors in the console caused by awaiting non-Promise functions",
        "Clicking “Sign Out” clears the React Query cache and returns the UI to the signed-out state reliably",
        "The Sign In button is disabled while `loginStatus === 'logging-in'` to prevent multiple concurrent login attempts"
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add clear, user-facing authentication error feedback anywhere the app prompts for login (header AuthButton area and AuthGate screen), using English text, including a visible error message when `loginStatus === 'loginError'` and an obvious “Try again” action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "nao esta dandopara fezer loguin"
        ]
      },
      "acceptanceCriteria": [
        "When Internet Identity fails to login, the UI displays an error message (derived from `loginError` when available) instead of silently failing",
        "A “Try again” action is provided that re-triggers login from a direct user click",
        "AuthGate’s sign-in screen also shows the error state and retry action if login fails"
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add basic troubleshooting hints on the AuthGate login screen for common Internet Identity issues (e.g., pop-up blockers, third-party cookies) using English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "nao esta dandopara fezer loguin"
        ]
      },
      "acceptanceCriteria": [
        "AuthGate includes a short hint section visible when the user is signed out (or when login fails) mentioning enabling pop-ups and allowing cookies for the identity provider",
        "No new authentication providers are introduced; this remains Internet Identity only"
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts or other paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep the backend as a single Motoko actor; no new backend canisters/services.",
    "Use English for any user-facing text in the UI changes."
  ],
  "nonGoals": [
    "Adding non-Internet-Identity authentication methods (OAuth, social login, email/password).",
    "Implementing real-time communication or external database integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}