{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Internet Identity login/logout UX responsiveness and error handling",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Make Sign In/Sign Out interactions responsive by removing incorrect awaits on non-Promise login/clear calls and ensuring consistent cache clearing on logout.",
      "acceptanceCriteria": [
        "Clicking “Sign In” triggers Internet Identity login reliably without unhandled promise/async errors in the console caused by awaiting non-Promise functions",
        "Clicking “Sign Out” clears the React Query cache and returns the UI to the signed-out state reliably",
        "The Sign In button is disabled while `loginStatus === 'logging-in'` to prevent multiple concurrent login attempts"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthButton.tsx",
          "operation": "modify",
          "description": "Update the AuthButton to stop `await`ing `login()` and `clear()` (they are non-Promise calls from the immutable hook), keep the UI responsive during transitions, and ensure logout still clears the React Query cache immediately after invoking `clear()`. Use the authorization component's frontend guidance for login/logout UX patterns; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Show user-facing authentication error feedback with a retry action in both the header AuthButton area and AuthGate screen.",
      "acceptanceCriteria": [
        "When Internet Identity fails to login, the UI displays an error message (derived from `loginError` when available) instead of silently failing",
        "A “Try again” action is provided that re-triggers login from a direct user click",
        "AuthGate’s sign-in screen also shows the error state and retry action if login fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthButton.tsx",
          "operation": "modify",
          "description": "Render an English, user-visible error message when `loginStatus === 'loginError'` (using `loginError?.message` when available) in the header auth area, and add an obvious “Try again” action that calls `login()` from a direct click. Use the authorization component's frontend error-handling guidance; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AuthGate.tsx",
          "operation": "modify",
          "description": "Extend AuthGate to display the same login error state (`loginStatus === 'loginError'`) with an English error message and a “Try again” action that re-triggers `login()` from a direct click. Use the authorization component's frontend error-handling guidance; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add basic troubleshooting hints on the AuthGate login screen for common Internet Identity login issues.",
      "acceptanceCriteria": [
        "AuthGate includes a short hint section visible when the user is signed out (or when login fails) mentioning enabling pop-ups and allowing cookies for the identity provider",
        "No new authentication providers are introduced; this remains Internet Identity only"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthGate.tsx",
          "operation": "modify",
          "description": "Add an English troubleshooting hint section on the signed-out AuthGate screen (and keep it visible on login error), covering common issues like pop-up blockers and third-party/cross-site cookies for the Internet Identity provider; do not introduce any new auth providers. Verify any referenced authorization component UX guidance before implementing."
        }
      ]
    }
  ]
}